interface MapColorType {
  [key: string]: string;
}

export const MAP_COLOR: MapColorType = {
  서울특별시: '#941E34',
  부산광역시: '#E6007E',
  대구광역시: '#008837 ',
  인천광역시: '#0079C1',
  광주광역시: '#EF4123',
  대전광역시: '#00AE4D',
  울산광역시: '#008C95',
  세종특별자치시: '#01A3E5',
  경기도: '#004097',
  충청북도: '#724698',
  충청남도: '#8C8C70',
  전라북도: '#024694',
  전라남도: '#FFCD00',
  경상북도: '#0071BB',
  경상남도: '#F15A38',
  제주특별자치도: '#F58220',
  강원특별자치도: '#D50037'
};

export const MAP_COLOR_INDEX: string[] = [
  '서울특별시',
  '부산광역시',
  '대구광역시',
  '인천광역시',
  '광주광역시',
  '대전광역시',
  '울산광역시',
  '세종특별자치시',
  '경기도',
  '충청북도',
  '충청남도',
  '전라북도',
  '전라남도',
  '경상북도',
  '경상남도',
  '제주특별자치도',
  '강원특별자치도'
];
